"An error occurred. Please try again." = "Seħħ żball. Jekk jogħġbok erġa' pprova.";

"Card brand was not updated. Please try again." = "Id-ditta tal-karti ma nbidlitx. Jekk jogħġbok erġa' pprova.";

"Close" = "Agħlaq";

"Default payment method was not updated. Please try again." = "Il-metodu tal-pagament standard ma nbidilx. Jekk jogħġbok erġa' pprova.";

"Scan Card" = "Skennja l-Karta";

"Scan card" = "Skennja l-karta";

"The IBAN you entered is invalid." = "L-IBAN li daħħalt mhux tajjeb.";

"There was an error processing your card -- try again in a few seconds" = "Seħħ żball aħna u nipproċessaw il-karta tiegħek -- erġa' pprova wara ftit sekondi";

"There was an unexpected error -- try again in a few seconds" = "Kien hemm żball mhux mistenni -- erġa' pprova wara ftit sekondi";

"Try again" = "Erġa' pprova";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "Aħna naħdmu ma' Stripe biex nivverifikaw id-dettalji tal-karta tiegħek. Stripe tista' tuża u taħżen id-dejta tiegħek skont il-politika tal-privatezza tagħha. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Sir af iktar</u></a>";

"Your card has expired" = "Il-karta tiegħek skadiet";

"Your card was declined" = "Il-karta tiegħek m'għaddietx";

"Your card's expiration month is invalid" = "Ix-xahar tal-iskadenza tal-karta tiegħek mhux tajjeb";

"Your card's expiration year is invalid" = "Is-sena tal-iskadenza tal-karta tiegħek mhix tajba";

"Your card's number is invalid" = "In-numru tal-karta tiegħek mhux tajjeb";

"Your card's security code is invalid" = "Il-kodiċi tas-sigurtà tal-karta tiegħek mhux tajjeb";

"Your name is invalid." = "L-isem li daħħalt mhux tajjeb.";

"Your payment method was declined." = "Il-metodu tal-pagament tiegħek m'għaddiex.";
